# CannotCreateMullionReferenceNoGeometry Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateMullionReferenceNoGeometry Property
BuiltInFailures..::..CreationFailures Class See Also
---
Can't create Curtain Wall Mullion. The portion of the curtain grid it was placed on no longer exists.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateMullionReferenceNoGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateMullionReferenceNoGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateMullionReferenceNoGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace